Config/Reports/PrintGuestDepartureForm.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>PrintGuestDepartureForm</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>InputParameter</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Accommodation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectPrintingForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ObjectPrintingForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckOutDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Print2On1Page</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Enums/PrintDirections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PrintDirections</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Screen</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Printer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLSX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ObjectPrintingForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ObjectPrintingForms</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Language</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Languages</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Reports</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalProcessing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplate</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileLoadTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileLastChangeTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Copies</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutomaticallyPrintOnFirstObjectWrite</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintFormPreview</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsActive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/PrintGuestDepartureForm/Forms/tcPrintGuestForm/Ext/Form/Module.bsl
// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	Report.Hotel = SessionParameters.CurrentHotel;
	If Parameters.Property("InputParameter") Then 
		If ValueIsFilled(Parameters.InputParameter) And TypeOf(Parameters.InputParameter) = Type("CatalogRef.GuestGroups") Then
			Report.GuestGroup = Parameters.InputParameter; 
			If ValueIsFilled(Parameters.InputParameter.ClientDoc) Then
				Report.Document  = Parameters.InputParameter.ClientDoc;	
			EndIf; 
			Report.Hotel = Parameters.InputParameter.GuestGroup.Owner;
		ElsIf ValueIsFilled(Parameters.InputParameter) And TypeOf(Parameters.InputParameter) = Type("DocumentRef.Accommodation") Then
			Report.Document  = Parameters.InputParameter;
			Report.Hotel = Parameters.InputParameter.Hotel;
		EndIf;
	Else
		Report.CheckOutDate = BegOfDay(CurrentSessionDate());
	EndIf;
	If Parameters.Property("ObjectPrintingForm") And ValueIsFilled(Parameters.ObjectPrintingForm) Then 
		Report.ObjectPrintingForm = Parameters.ObjectPrintingForm;
	Else
		Report.ObjectPrintingForm = Catalogs.ObjectPrintingForms.AccommodationPrintDepartureNotificationForm;
	EndIf;	
	If Parameters.Property("OneGuestMode") Then 
		SelOneGuestMode = Parameters.OneGuestMode;
	EndIf;
	Report.Print2On1Page = False;   
	TypeOfPrint = 3;
EndProcedure // OnCreateAtServer

// -----------------------------------------------------------------------------
&AtServer
Procedure GenerateReport(pButton = Undefined, rDoPrint = Undefined)
	// Check attributes
	If CheckAttributes() Then
		// Get output spreadsheet
		vSpreadsheet = GuestFormSpreadsheet;
		
		// Load external printing form template
		vExtTemplate = cmReadExternalSpreadsheetDocumentTemplate(Report.ObjectPrintingForm);
		
		// Generate report
		vReportObj = FormAttributeToValue("Report");
		vReportObj.pmGenerate(vSpreadsheet, vExtTemplate, SelOneGuestMode, TypeOfPrint);

		// Setup default attributes
		cmSetDefaultPrintFormSettings(vSpreadsheet, PageOrientation.Portrait);
		If Report.Print2On1Page Then
			vSpreadsheet.LeftMargin = 1;
			vSpreadsheet.RightMargin = 1;
			vSpreadsheet.TopMargin = 1;
			vSpreadsheet.BottomMargin = 1;
			vSpreadsheet.HeaderSize = 1;
			vSpreadsheet.FooterSize = 1;
		EndIf;
		// Check authorities
		cmSetSpreadsheetProtection(vSpreadsheet);
		// Get and fill workstation print form settings
		If ValueIsFilled(SessionParameters.CurrentWorkstation) Then
			vWorkstationPrintSettings = SessionParameters.CurrentWorkstation.WorkstationPrintSettings;
			If ValueIsFilled(vWorkstationPrintSettings) Then
				// Try to find records for the current object print form
				vFilter = New Structure("ObjectPrintingForm, IsActive", Report.ObjectPrintingForm, True); 
				vPrintSettingsSet = vWorkstationPrintSettings.PrintFormsList.FindRows(vFilter);
				If vPrintSettingsSet.Count() > 0 Then
					For Each vPrintSettings In vPrintSettingsSet Do
						// Fill settings
						cmSetSpreadsheetSettings(vSpreadsheet, vPrintSettings);
						// Check printing direction
						If vPrintSettings.PrintDirection <> Enums.PrintDirections.Screen Then
							vName = cmGetPrintFormFileName(vPrintSettings, NStr("en='Guest forms';ru='Формы гостя';de='Formen des Gastes'"));
							cmDoSpreadsheetOutput(vSpreadsheet, vPrintSettings, vName, , rDoPrint);
						EndIf;
					EndDo;
				EndIf;
			EndIf;
		EndIf;
	EndIf;
EndProcedure // GenerateReport

// -----------------------------------------------------------------------------
&AtClient
Procedure OnOpen(pCancel)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
		pCancel = true;
	EndIf;
EndProcedure // OnOpen

// -----------------------------------------------------------------------------
&AtServer
Function CheckAttributes()
	If Not ValueIsFilled(Report.Document) 
	   And Not ValueIsFilled(Report.GuestGroup) 
	   And Not ValueIsFilled(Report.CheckOutDate) Then
		tcCommonFunctionOnClientServer.UserMessage(NStr("ru='Для печати не выбраны ни документ ни группа гостей ни дата выезда!';
		                                                |de='Für den Druck wurden weder das Dokument, noch die Gästegruppe oder abreise Datum gewählt!';
														|en='Neither document no guest group or check-out date is selected for printing!'"));
		Return False;
	EndIf;
	Return True;
EndFunction // CheckAttributes

// -----------------------------------------------------------------------------
&AtClient
Procedure Print(pCommand)
	GuestFormSpreadsheet.Print();
	ThisForm.Close();
EndProcedure // Print

// -----------------------------------------------------------------------------
&AtClient
Procedure ChoosePrinter(pCommand)
	GuestFormSpreadsheet.Print(PrintDialogUseMode.Use);
	ThisForm.Close();
EndProcedure // ChoosePrinter

// -----------------------------------------------------------------------------
&AtClient
Procedure SaveAsPDF(pCommand)
	vFilePath = "";
	vFileType = SpreadsheetDocumentFileType.PDF;
	tcOnClient.SaveSpreadsheetToFile(vFileType, vFilePath, GuestFormSpreadsheet);
EndProcedure // SaveAsPDF

// -----------------------------------------------------------------------------
&AtClient
Procedure DocumentOnChange(pItem)
	If ValueIsFilled(Report.Document) Then
		Report.CheckOutDate = '00010101';
		Report.Hotel = tcOnServer.cmGetAttributeByRef(Report.Document, "Hotel");
		Report.GuestGroup = tcOnServer.cmGetAttributeByRef(Report.Document, "GuestGroup");
	EndIf;
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // DocumentOnChange

// -----------------------------------------------------------------------------
&AtClient
Procedure GuestGroupOnChange(pItem)
	If ValueIsFilled(Report.GuestGroup) Then
		Report.Hotel = tcOnServer.cmGetAttributeByRef(Report.GuestGroup, "Owner");
		Report.Document = tcOnServer.cmGetAttributeByRef(Report.GuestGroup, "ClientDoc");
	EndIf;
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // GuestGroupOnChange

// -----------------------------------------------------------------------------
&AtClient
Procedure Print2On1PageOnChange(pItem)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // Print2On1PageOnChange

// -----------------------------------------------------------------------------
&AtClient
Procedure GuestGroupStartChoice(pItem, pChoiceData, pStandardProcessing)
	pStandardProcessing = False;
	OpenForm("Catalog.GuestGroups.ChoiceForm", , pItem, , , , New NotifyDescription("AfterGuestGroupStartChoice", ThisForm, New Structure("Item", pItem)), FormWindowOpeningMode.LockOwnerWindow);
EndProcedure // GuestGroupStartChoice

// -----------------------------------------------------------------------------
&AtClient
Procedure AfterGuestGroupStartChoice(pResult, pParams) Export
	If pResult <> Undefined Then
		GuestGroup = pResult;
		GuestGroupOnChange(pParams.Item);
	EndIf;
EndProcedure // AfterGuestGroupStartChoice

// -----------------------------------------------------------------------------
&AtClient
Procedure CheckOutDateOnChange(pItem)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // CheckOutDateOnChange

// -----------------------------------------------------------------------------
&AtClient
Procedure RoomTypeOnChange(pItem)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // RoomTypeOnChange

// -----------------------------------------------------------------------------
&AtClient
Procedure Generate(Command)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
		pCancel = true;
	EndIf;
EndProcedure // Generate

// -----------------------------------------------------------------------------
&AtClient
Procedure TypeOfPrintOnChange(Item)
	// Generate report
	rDoPrint = Undefined;
	GenerateReport(, rDoPrint);
	If rDoPrint <> Undefined Then
		rDoPrint.Spreadsheet.Print(PrintDialogUseMode[rDoPrint.PrintDialogUseMode]);
	EndIf;
EndProcedure // TypeOfPrintOnChange
